Autodesk.Revit.DB.FDXImportOptions.SetLogOutputDirectory(System.String)
Sets the directory path where log files will be written during import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.0.2

Autodesk.Revit.DB.FDXImportOptions.CreateGrids
Controls whether to create Grids from FDX or not.
Since:
2023.0.2